### Chapter 1: Disco of the Wild Wolves

第一章 野狼迪斯科

"Have you ever thought that every single tree here might eat people at night? I seriously suspect that our summer camp is a colossal, earth-shattering, sky-darkening, lawless conspiracy with the sole purpose of devouring us kids!" Lin Xiaopang whispered to Xia Xiaoxiao and Wang Zijun.

“你有考虑过这里的每一棵树到了晚上都会吃人吗？我严重怀疑我们的夏令营就是一场惊天动地，昏天黑地，无法无天的巨大阴谋，目的就是要把我们这些小孩子全部吃光光！”林小胖低声对夏晓晓和王子军说道。

Xia Xiaoxiao couldn't stand his bad breath and rolled her eyes at him.

夏晓晓忍不了他的口臭，白了他一眼。

"First, I admit you have a vivid imagination, which is a polite way of saying I think you're an idiot. Second, you're using those idioms incorrectly, no wonder you always flunk Chinese. Third, I agree with you on one point: it's really dark now because it's 2 AM, okay?"

“第一，我承认你真的很有想象力，换句话解释就是我认为你是白痴，第二，那三个成语不是这么用的，怪不得你每次语文都是吊车尾啦，第三，有一点我承认你说得对，现在是挺黑的，因为现在是深夜两点，好不好。”

Seeing that Xia Xiaoxiao didn't believe him, Lin Xiaopang urgently said, "I'm telling the absolute truth, Xiaoxiao. The evidence is Teacher Ma!"

林小胖见夏晓晓不相信他，急道：“我说的千真万确啊晓晓，证据就是马老师！”

Let's switch to Lin Xiaopang's perspective. Yesterday at 2 AM, Lin Xiaopang, who was sleeping soundly, suddenly felt uncomfortable in his dream, struggling to breathe. He woke up to find Da Chun, his tentmate, had unknowingly stuffed his two toes into Lin Xiaopang's nostrils.

让我们时间回到林小胖视角，昨天凌晨两点，熟睡的林小胖美梦中忽感身体不适，无法呼吸，惊醒后发现是同一个帐篷的大春同学滥睡，无意中把两个脚趾捅进林小胖鼻孔里。

Not only that, but Lin Xiaopang also felt a slight urge to defecate. It turned out Da Chun had inserted the big toe of his other foot into Xiaopang's underwear, scratching his anus. Xiaopang, being gentle, didn't get angry. In fact, Da Chun's scratching felt rather pleasant.

不仅如此，小胖下半身还带有一丝丝便意，原来是大春同学把另一只脚的脚的脚拇指塞进小胖的内裤里的屁眼一直在挠呀挠，小胖很温柔，并没有因此气愤，更何况大春给他挠的挺舒服的。

Xiaopang just gently moved Da Chun's foot away, careful not to wake him, and quietly prepared to unzip the tent to go to the toilet.

小胖只是把脚轻轻给他挪开，生怕吵醒大春睡觉，自己悄摸摸，准备拉开帐篷拉链去上厕所。

Then, something terrifying happened! He couldn't unzip the tent, and there was a shadow of a hand outside!

让人惊恐的事情发生了！他的帐篷，拉不开，帐篷外面还有一只手掌的影子！

It must be a wild man, an ape-man, some terrifying humanoid creature attacking their camp.

一定是有野人，猿人，反正就是很恐怖的类人生物袭击了他们营地。

Teacher Ma, Xia Xiaoxiao, Wang Zijun, and their classmates from the same grade must have locked the tent from outside to protect him and Da Chun. How touching!

马老师，夏晓晓，王子军，还有同班，同年级的各位为了保护他和大春，把帐篷在外面锁死了，多么令人感动！

Thinking of his classmates dying for him, he couldn't help but feel sorrowful. Oh, it turned out he had just zipped the tent incorrectly and wasn't fully awake.

一想到同学们为他而死，不禁悲从中来！噢，原来只是帐篷拉链拉反了，没睡醒。

Xiaopang chuckled and peeked his head out of the tent, cautiously looking around. There was only the crescent moon, rustling trees, and countless tents. Where were the expected ferocious wild men or ape-men?

小胖噗嗤一下把头冒出帐篷警惕得两边张望，只有月亮勾勾，树木婆娑，帐篷无数，哪里有什么期待中残暴的野人，猿人。

Thinking that his classmates hadn't died for him, he felt a mix of relief and sadness. He checked his watch; it was time.

一想到同学们没有为他而死，不禁悲从中来。他看一下手表，时间差不多了。

He unzipped the tent, took his camera and tape, and walked into the forest. Before the camp, he had looked at the map on Google Maps. This small forest was actually a cliff, and after walking for less than half an hour, the moon would align with the cliff.

拉开帐篷，带上相机和胶带，向森林里走去，他在夏令营之前，通过谷歌地图查阅过这里的地图，通过这一小小片森林，其实是一个悬崖，从此步行不到半小时，届时，月亮将与悬崖重合。

All he needed to do was tie the camera to a tree, stand on the cliff, and pee upwards, with the moon enveloping the cliff and the stream of urine creating an artistic composition that even the great works of the Louvre would have to bow to.

他只要把相机绑在一遍的树上，然后站在悬崖上挺着腰往上尿尿，明月包着悬崖，悬崖上尿尿，如此构图，想必即便是卢浮宫的历代艺术天才作品也要退让三分吧。

More importantly, the only important thing, this photo would cement his legendary status in elementary school, passing down through the ages, long live the king.

更重要的是，当然也是唯一重要的是这张照片将奠定他在小学的传奇地位，永世流传，与天地共寿，long live the king。

Half an hour later, Xiaopang stood on the cliff, waiting for the moon to rise. Despite practicing holding his pee for this moment, like preparing for a proposal, he was almost at his limit.

半个小时过后，小胖站在悬崖上等月亮爬上来，尽管他为了此刻像求婚一样反复练习憋尿，但还是有点快憋不住了。

The worst part was a huge uninvited cloud following the moon. Just as things were about to go awry, the cloud slowed down and turned away, and the moon, at a steady pace, hung perfectly over the cliff.

而最糟糕的是，跟着月亮爬上来的还有一大朵不识抬举的乌云，就在事情要功亏一篑之时，乌云突然减速掉头，月亮则匀速甩开乌云，准时得挂在了悬崖上。

It seemed even God was merciful and eager to see this masterpiece. Xiaopang thought about the eternal moment of his pee, imagining it hanging in the Louvre alongside the Mona Lisa for all generations to admire.

看来上帝也在垂怜我，盼望要看到这张旷世佳作，小胖想到自己得小便的永恒一刻，如若能挂在卢浮宫与蒙娜丽莎一起供万世景仰。

He decided to name this photo "Crescent Heaven Strike."

那么这幅照片就起名为《月牙天冲》。

如果需要进一步修改或添加其他部分，请告诉我！
