### Chapter 1: Disco of the Wild Wolves

第一章 野狼迪斯科

"Have you ever thought that every single tree here might eat people at night? I seriously suspect that our summer camp is a colossal, earth-shattering, sky-darkening, lawless conspiracy with the sole purpose of devouring us kids!" Lin Xiaopang whispered to Xia Xiaoxiao and Wang Zijun.

“你有考虑过这里的每一棵树到了晚上都会吃人吗？我严重怀疑我们的夏令营就是一场惊天动地，昏天黑地，无法无天的巨大阴谋，目的就是要把我们这些小孩子全部吃光光！”林小胖低声对夏晓晓和王子军说道。

Xia Xiaoxiao couldn't stand his bad breath and rolled her eyes at him.

夏晓晓忍不了他的口臭，白了他一眼。

"First, I admit you have a vivid imagination, which is a polite way of saying I think you're an idiot. Second, you're using those idioms incorrectly, no wonder you always flunk Chinese. Third, I agree with you on one point: it's really dark now because it's 2 AM, okay?"

“第一，我承认你真的很有想象力，换句话解释就是我认为你是白痴，第二，那三个成语不是这么用的，怪不得你每次语文都是吊车尾啦，第三，有一点我承认你说得对，现在是挺黑的，因为现在是深夜两点，好不好。”

Seeing that Xia Xiaoxiao didn't believe him, Lin Xiaopang urgently said, "I'm telling the absolute truth, Xiaoxiao. The evidence is Teacher Ma!"

林小胖见夏晓晓不相信他，急道：“我说的千真万确啊晓晓，证据就是马老师！”

Let's switch to Lin Xiaopang's perspective. Yesterday at 2 AM, Lin Xiaopang, who was sleeping soundly, suddenly felt uncomfortable in his dream, struggling to breathe. He woke up to find Da Chun, his tentmate, had unknowingly stuffed his two toes into Lin Xiaopang's nostrils.

让我们时间回到林小胖视角，昨天凌晨两点，熟睡的林小胖美梦中忽感身体不适，无法呼吸，惊醒后发现是同一个帐篷的大春同学滥睡，无意中把两个脚趾捅进林小胖鼻孔里。

Not only that, but Lin Xiaopang also felt a slight urge to defecate. It turned out Da Chun had inserted the big toe of his other foot into Xiaopang's underwear, scratching his anus. Xiaopang, being gentle, didn't get angry. In fact, Da Chun's scratching felt rather pleasant.

不仅如此，小胖下半身还带有一丝丝便意，原来是大春同学把另一只脚的脚的脚拇指塞进小胖的内裤里的屁眼一直在挠呀挠，小胖很温柔，并没有因此气愤，更何况大春给他挠的挺舒服的。

Xiaopang just gently moved Da Chun's foot away, careful not to wake him, and quietly prepared to unzip the tent to go to the toilet.

小胖只是把脚轻轻给他挪开，生怕吵醒大春睡觉，自己悄摸摸，准备拉开帐篷拉链去上厕所。

Then, something terrifying happened! He couldn't unzip the tent, and there was a shadow of a hand outside!

让人惊恐的事情发生了！他的帐篷，拉不开，帐篷外面还有一只手掌的影子！

It must be a wild man, an ape-man, some terrifying humanoid creature attacking their camp.

一定是有野人，猿人，反正就是很恐怖的类人生物袭击了他们营地。

Teacher Ma, Xia Xiaoxiao, Wang Zijun, and their classmates from the same grade must have locked the tent from outside to protect him and Da Chun. How touching!

马老师，夏晓晓，王子军，还有同班，同年级的各位为了保护他和大春，把帐篷在外面锁死了，多么令人感动！

Thinking of his classmates dying for him, he couldn't help but feel sorrowful. Oh, it turned out he had just zipped the tent incorrectly and wasn't fully awake.

一想到同学们为他而死，不禁悲从中来！噢，原来只是帐篷拉链拉反了，没睡醒。

Xiaopang chuckled and peeked his head out of the tent, cautiously looking around. There was only the crescent moon, rustling trees, and countless tents. Where were the expected ferocious wild men or ape-men?

小胖噗嗤一下把头冒出帐篷警惕得两边张望，只有月亮勾勾，树木婆娑，帐篷无数，哪里有什么期待中残暴的野人，猿人。

Thinking that his classmates hadn't died for him, he felt more sadness than ever. He checked his watch; it was time.

一想到同学们没有为他而死，不禁更加悲从中来。他看一下手表，时间差不多了。

He unzipped the tent, took his camera and tape, and walked into the forest. Before the camp, he had looked at the map on Google Maps. This small forest was actually a cliff, and after walking for less than half an hour, the moon would align with the cliff.

拉开帐篷，带上相机和胶带，向森林里走去，他在夏令营之前，通过谷歌地图查阅过这里的地图，通过这一小小片森林，其实是一个悬崖，从此步行不到半小时，届时，月亮将与悬崖重合。

All he needed to do was tie the camera to a tree, stand on the cliff, and pee upwards, with the moon enveloping the cliff and the stream of urine creating an artistic composition that even the great works of the Louvre would have to bow to.

他只要把相机绑在一遍的树上，然后站在悬崖上挺着腰往上尿尿，明月包着悬崖，悬崖上尿尿，如此构图，想必即便是卢浮宫的历代艺术天才作品也要退让三分吧。

More importantly, and the only important thing is that this photo would cement his legendary status in his elementary school, passing down through the ages, long live the king.

更重要的是，当然也是唯一重要的是这张照片将奠定他在小学的传奇地位，永世流传，与天地共寿，long live the king。

Half an hour later, Xiaopang stood on the cliff, waiting for the moon to rise. Despite practicing holding his pee for this moment, like preparing for a proposal, he was almost at his limit.

半个小时过后，小胖站在悬崖上等月亮爬上来，尽管他为了此刻像求婚一样反复练习憋尿，但还是有点快憋不住了。

The worst part was a huge uninvited cloud following the moon. Just as things were about to go awry,The cloud suddenly slowed down and turned away, while the moon hit the gas, sped up, and left the cloud behind, perfectly hanging over the cliff.

而最糟糕的是，跟着月亮爬上来的还有一大朵不识抬举的乌云，就在事情要功亏一篑之时，乌云突然减速掉头，月亮则油门踩死，加速甩开乌云，准时得挂在了悬崖上。

It seemed even God was merciful and eager to see this masterpiece. Xiaopang thought about the eternal moment of his pee, imagining it hanging in the Louvre alongside the Mona Lisa for all generations to admire.

看来上帝也在垂怜我，盼望要看到这张旷世佳作，小胖想到自己得小便的永恒一刻，如若能挂在卢浮宫与蒙娜丽莎一起供万世景仰。

He decided to name this photo "Crescent Heaven Strike."

那么这幅照片就起名为《月牙天冲》。

### “Oh my gosh, whose pee is this!” 
“哎哟我去，这谁的尿！”

Unexpectedly, the cliff wasn't a cliff at all but a large rock. It was so dark at night that he couldn't see below. Only now did Xiaopang notice that under the rock were PE teacher Mr. Ma and the notoriously fierce Vice Principal Liu.
没想到悬崖竟然不是悬崖，只是一块比较巨大的岩石，晚上黑咕隆咚看不见下面，此时小胖才注意到岩石下是体育老师马老师，以及以凶狠残暴广为人知的刘副校长。

They were discussing some unknown secret in the middle of the night. Vice Principal Liu noticed the heavy rain with a bit of a strange smell and shouted.
他们大半夜在这里讨论什么不为人知的秘密，刘副校长注意到大雨淋下，还带点骚味，大叫一声。

Xiaopang, scared out of his wits, didn't even put on his pants properly and quickly lay flat on the rock, not daring to make a sound.
小胖吓得裤子没穿上，赶忙趴在岩石不敢出声。

With every curse Vice Principal Liu uttered, Xiaopang could hear footsteps getting closer to him. If this continued, before Liu ran out of curses, he would be caught and beaten like a stray cat or dog that had bitten someone. 
刘校长每骂出一句，小胖就能听到一个两个脚步向他靠近，在这样下去，没等刘校长词穷，他就要被捕获了，像很多地方咬了人的流浪猫狗一样，会被乱棍超度。

Maybe he should just turn and run? Deciding quickly, Xiaopang turned and sprinted away, only to crash headfirst into a tree.
要不转头就跑吧，当机立断，小胖扭头拔腿却迎面撞上一颗树。

The impact was enough to make Xiaopang and the tree "bond deeply," bird droppings scattering all over Xiaopang's head.
冲击力足以让小胖和树’身心交融‘，树上鸟粪散落小胖头顶。

"Damn it, where did this tree come from? It wasn't here just now," Xiaopang thought. He decided to keep running, estimating he ran for another two minutes.
‘妈蛋，这树哪里来的，刚刚明明没有’，小胖心想，跑路要紧，于是又跑了估计两分钟。

Actually, it was only one minute and twenty-eight seconds because overweight people tend to overestimate their efforts. Anyway, at least no principals or teachers were chasing him now.
其实是一分钟二十八秒，因为肥胖的人总会高估自己的努力。总之，后面总算是没有校长，老师这些类人生物追上来了。

Xiaopang, hands on his knees, panted heavily. After a while, he stood up and took a few steps.
小胖双手撑着膝盖，呼呼喘气，好不一会儿，才站起来走两步。

Suddenly, he felt something was off. What was wrong? It was the feeling, the sixth sense of danger like a mouse being watched by a country cat, a sweet premonition of death.
忽然又感觉不太对，什么不太对呢，是那种感觉，那种被农村猫咪盯上的老鼠的危机第六感，是甜甜的死亡预告。

He looked back, seeing nothing but quietness. "Hmm, why is there an extra tree on the path I just ran?" he thought. He decided to get closer and check it out.
他回头看一眼，除了安静找不到任何形容词，咦，跑来的路上怎么多了一棵树，自己刚刚怎么没撞上。

This tree looked very familiar, with bird droppings on the left branch. It was the same tree he had crashed into! Could trees move now? No time to think, Xiaopang scrambled away in a panic.
小胖没多想，便做出了一个决定，靠近那颗树看看。这棵树，真的很眼熟，左边树枝还挂着鸟粪，可不就是他撞上那棵树么，树也会跑路了？来不及思考，小胖立即连滚带爬地逃命。

Driven by his will to survive, he ran through the tropical forest for five minutes. Exhausted and barely able to breathe, he finally stopped.
求生得意志让他足足在热带森林驰骋了五分钟，最终累到无法呼吸，小胖才勉强又停了下来。

Turning around, he saw the same tree again. This time, the branches had switched positions, like the tree was running with its arms swinging back and forth.
扭头一看，还是那棵树，不过不同的是，原来树得枝桠是左边在后下方，右边是在前上方，现在则相反，简直就像树在奔跑，双手前后交换摆动。

Terrified, Xiaopang broke into a cold sweat. He turned and ran a few more steps, then looked back. Sure enough, the tree had moved closer again, this time in a different position.
小胖冷汗直冒，又背过去跑了几步，回头看，树果不其然向自己靠近了几步，这次又换了另一个姿势。

"Mommy, it's haunted!" Xiaopang dropped to his knees, begging and pleading, "Tree demon, please spare my life!"
妈耶闹鬼了，小胖扑通一下跪下来，求爷爷告奶奶，求树妖大人，放他一条生路。

But after a long while, the tree demon didn't move an inch. However, Xiaopang's mind 'heard' a voice. It wasn't through his ears but more like telepathy. The voice said, "Go on, I forgive you for stepping on my roots twice."
然而过了许久，树妖却纹丝未动，但林小胖的脑子’听‘到一句话，之所以是’听‘，是因为并不是用耳朵听到，而是一种心灵感应，话里说’你走吧，我原谅你两次踩到我的根的罪恶行径了‘。

Xiaopang knocked his head three times on the ground, thanking profusely, shouting, "Thank you, great tree demon! Your magnanimity is as vast as the flooding Yellow River and the roaring Yangtze, as endless as the clear skies. I will never forget your kindness!"
小胖跪着连磕三个响头，大恩言谢，大声高喊：“感恩树妖大人，树妖大人的广阔胸怀，简直如同黄河泛滥，长江涛涛，又如，晴空万里，一望无际，树妖大人，您的广阔胸怀，小胖我没齿难忘啊”。

After he finished shouting, his mind heard another voice, "I've changed my mind. You better stay; you look quite tasty."
喊完事后小胖脑子里又听到了一句，’我改变主意了，你还是留下吧，怪肥美的‘。

"Ah, you untrustworthy monster! Baka!" Xiaopang had just started cursing when the tree branches, stretched out like tug-of-war ropes, wrapped around his feet and wound up to his neck.
“啊，你这臭妖怪怎么不讲信用啊，八嘎呀路哇哇哇哇”，小胖才喷了两句，便被伸长得像拔河比赛得麻绳一样的树枝从脚绑起来一层一层卷到脖子上。

"I'm sorry, Mom and Dad. I'm sorry I can't play Nintendo games anymore. It's such a pity I never got to put a ring on my future wife's finger, visit the center of Antarctica to feed penguins, leap from the roof of Notre-Dame, or ride Elon Musk's rocket to Mars.
“对不起，爸爸妈妈，对不起，我那再也玩不到得任天堂游戏，好遗憾啊，没有把戒指给未来的太太戴上，没有去过南极中心喂企鹅，没有在巴黎圣母院房顶来一场信仰之跃，没有坐上马斯克的火箭去火星。

My life is full of regrets, but at least I had the joy of anticipation." Without a life flashing before his eyes, Xiaopang closed them forever.
我的人生充满了遗憾，当然活着也不一定能实现就是了，不过起码有期待的快乐”没有走马灯，说完这句话，小胖便永远得闭上眼睛。

This 'forever' lasted three seconds. The next moment, 'It's the temptation from Lang, I start singing a love song. In the desired sky, there is beautiful moonlight.' The air was filled with the BGM of Phoenix Legend, approaching from afar.
这个永远持续了三秒，下一刻，’是郎给的诱惑 我唱起了情歌，在渴望的天空 有美丽的月色‘空气中弥漫着凤凰传奇的bgm，由远及近。

The awkward atmosphere made even the tree demon tremble. "Who is it?" the tree

 demon shouted through telepathy.
这种令人尴尬的气氛，连树妖都为之一颤，’是谁！‘，树妖用心灵感应大叫道。

The next second, Xiaopang saw the ropes binding him being cut vertically by a long knife held in the mouth of a walking wolf. To be precise, it was a small boy, less than a meter tall, draped in a wolf skin.
下一秒小胖便看到捆绑自己的绳子被一刀竖着切开，竟然是一头嘴上咬着两米长刀的直立行走的狼，准确来说，是一个一米不到得小男孩，身披狼皮。

The wolf skin was too long and dragged on the ground. The wolf's head held the long knife, and its eyes didn't look like those of a dead thing. Was the wolf skin the main body, or was the boy the main body, or were both?
狼皮太长拖在地上，狼头还叼着长刀，狼头得眼珠根本就不像是死物，到底狼皮是本体还是小男孩是本体，或者都是本体呢。

Overjoyed, Xiaopang fainted, the last thing he muttered was, "You are... Daolang?"(Daolang, a famous Chinese singer, whose name 'Dao' sounds like 'knife' and 'Lang' sounds like 'wolf' in Chinese. This is a pun.)
小胖大喜过望，眼前一黑，竟晕厥过去了，嘴上念叨最后一句：“你是？刀郎？”
